IDEA Open Model
SectionResultMesh Class
Compatible with IDEA StatiCa v 10.1
 Section result mesh
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.SectionResultMesh
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public class SectionResultMesh : SectionResultBase
Public Class SectionResultMesh
	Inherits SectionResultBase
public ref class SectionResultMesh : public SectionResultBase
The SectionResultMesh type exposes the following members.
Constructors
Name | Description
SectionResultMesh
 Constructor
Top
Properties
Name | Description
Elements
 Elements
Loading
 Loading
 (Inherited from SectionResultBase.)
Points
 Section points
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace